import React from 'react';

// helper Component
import ScrollToTop from '../helper/ScrollToTop';

// Images
import blog01 from '../images/blog01.jpeg';
import blog02 from '../images/blog02.jpeg';
import blog03 from '../images/blog03.jpeg';
import blog04 from '../images/blog04.jpeg';

const BlogPage = () => {
    return (
        <div className='flex flex-col justify-center items-center px-8'>
            <ScrollToTop />
            <div className="flex flex-col items-center lg:items-start text-center lg:text-right px-8 w-full pt-36">
                <h1 className="text-lg font-bold text-textColor">وبلاگ های آزمایشگاه</h1>
                <div className="h-1 w-20 bg-primaryColor rounded mt-4"></div>
            </div>
            <div className='flex flex-col lg:flex-row lg:px-24 py-12 border-b border-gray'>
                <div className='lg:pl-28 pb-12 lg:pb-0'>
                    <h3 className="text-primaryColor text-xl mb-4">ویروس کرونا: نگاهی جامع به ابعاد مختلف تا کنترل بیماری</h3>
                    <p className="leading-loose text-justify text-textColor">این مقاله به طور جامع به زمینه‌های مختلف ویروس کرونا می‌پردازد، شامل مسائلی از جمله انتقال ویروس، علائم و عوارض، روش‌های تشخیص، واکسیناسیون، و راهکارهای کنترل و پیشگیری از انتشار این بیماری. همچنین به اهمیت توجه به دستورالعمل‌های بهداشتی و اجتناب از تماس نزدیک با افراد مبتلا تا کاهش انتقال ویروس تاکید می‌شود. ویروس کرونا یک گونه ویروس RNA است که اعضای مختلفی از جمله انسان‌ها و حیوانات را تحت تأثیر قرار می‌دهد. این ویروس ممکن است علائمی از سرماخوردگی تا بیماری‌های جدی از جمله سندرم تنفسی حاد شدید (SARS) و سندرم تنفسی خاورمیانه (MERS) را ایجاد کند. جهش‌های ویروس کرونا نقش بسیار مهمی در تغییر و شکل‌گیری آن دارند. جهش‌ها باعث می‌شوند تا ویروس تغییر شکل بدهد و بتواند به طور مداوم با محیط خود تطابق پیدا کند. برخی از جهش‌ها ممکن است باعث افزایش قدرت آلودگی و یا مقاومت به درمان‌ها شوند. از جمله جهش‌هایی که برای ویروس کرونا گزارش شده، جهش دلتا (B.1.617.2) و جهش اومیکرون (B.1.1.529) است که هر دو با افزایش قابلیت انتقال ویروس مرتبط هستند. برای مقابله با جهش‌های ویروس کرونا، اجرای برنامه‌های واکسیناسیون گسترده و اجرای دستورالعمل‌های بهداشتی مهم است تا انتقال و شیوع ویروس مهار شود و اثرات منفی آن کاهش یابد. ویروس کرونا همچنان در برخی نقاط جهان کشنده است، اگرچه با پیشرفت در دسترسی به واکسیناسیون و درمان‌ها، نرخ مرگ و میر نسبت به ابتدای شیوع ویروس کاهش یافته است. با این حال، ویروس همچنان می‌تواند در مواردی با عوارض جدی و حتی مرگبار همراه باشد، به‌ویژه در مواردی که افراد دارای عوامل خطر از جمله سن بالا، بیماری‌های مزمن، یا سیستم ایمنی ضعیف هستند. به همین دلیل، رعایت دستورالعمل‌های بهداشتی، واکسیناسیون، و مراجعه به مراکز درمانی در صورت بروز علائم مهم است تا از شیوع ویروس و عوارض جدی آن جلوگیری شود. در پایان، ویروس کرونا به عنوان یک چالش جهانی همچنان بر جوامع تأثیر می‌گذارد. با این حال، از طریق واکسیناسیون گسترده، رعایت دستورالعمل‌های بهداشتی، و توجه به رویکردهای درمانی نوین، می‌توان این بیماری را مهار کرده و آثار منفی آن را کاهش داد. این نشان می‌دهد که همکاری جهانی و تدابیر هوشمندانه می‌تواند در مقابله با تهدیدات بهداشتی بزرگ موثر باشد.</p>
                </div>
                <img src={blog01} alt='blogimage' className='object-cover w-[500px] rounded-lg shadow-2xl'/>
            </div>
            <div className='flex flex-col lg:flex-row lg:px-24 py-12 border-b border-gray'>
                <img src={blog02} alt='blogimage' className='object-cover w-[500px] rounded-lg shadow-2xl'/>
                <div className='lg:pr-28 pt-12 lg:pt-0'>
                    <h3 className="text-primaryColor text-xl mb-4">دیابت: شناخت، پیشگیری و مدیریت</h3>
                    <p className="leading-loose text-justify text-textColor">دیابت یکی از بیماری‌های شایع و مزمن جهان است که باعث افزایش قند خون در بدن می‌شود و در صورت عدم مدیریت مناسب، به عوارض جدی منجر می‌شود. در این مقاله، با توجه به اهمیت پیشگیری از دیابت و مدیریت آن، به بررسی راهکارهای موثر برای کاهش خطر ابتلا به این بیماری پرداخته خواهد شد.</p>
                    <p className="leading-loose text-justify text-red">دیابت چیست و چگونه ایجاد می‌شود؟</p>
                    <p className="leading-loose text-justify text-textColor"></p> دیابت ناکافی بودن انسولین (یا مقاومت به انسولین)، هورمونی که برای کنترل قند خون لازم است، در بدن است. این موجب افزایش قند خون و مشکلات متعدد سلامتی می‌شود.
                    <p className="leading-loose text-justify text-red">چه علائمی نشانگر مبتلا شدن به دیابت هستند؟</p>
                    <p className="leading-loose text-justify text-textColor">علائم دیابت شامل ادرار زیاد، تشنج، خستگی، تشنگی شدید، و کاهش وزن بدون دلیل آشکار می‌شود.</p>
                    <p className="leading-loose text-justify text-red">چه فاکتورهایی موجب افزایش خطر ابتلا به دیابت می‌شوند؟</p>
                    <p className="leading-loose text-justify text-textColor"> فاکتورهایی نظیر ژنتیک، چاقی، فعالیت بدنی کم، و مصرف بیش از حد قند و چربی‌های اشباع شده می‌توانند خطر ابتلا به دیابت را افزایش دهند.</p>
                    <p className="leading-loose text-justify text-red">چگونه می‌توان از دیابت جلوگیری کرد؟</p>
                    <p className="leading-loose text-justify text-textColor">برای پیشگیری از دیابت، فعالیت بدنی منظم، رژیم غذایی سالم، کنترل وزن، و اجتناب از مصرف قند و چربی‌های زیاد توصیه می‌شود.</p>
                    <p className="leading-loose text-justify text-red">چه راهکارهایی برای مدیریت دیابت و کنترل قند خون وجود دارد؟</p>
                    <p className="leading-loose text-justify text-textColor"> برای مدیریت دیابت، رژیم غذایی مناسب با کمک متخصص تغذیه، فعالیت بدنی منظم، استفاده از داروها (در صورت نیاز)، و کنترل مستمر قند خون از طریق اندازه‌گیری خود قند خون و مداومت با پزشک معالج لازم است.</p>
                </div>
            </div>
            <div className='flex flex-col lg:flex-row lg:px-24 py-12 border-b border-gray'>
                <div className='lg:pl-28 pb-12 lg:pb-0'>
                    <h3 className="text-primaryColor text-xl mb-4">پروستات: علائم، درمان، و پیشگیری</h3>
                    <p className="leading-loose text-justify text-textColor">بیماری‌های پروستات از جمله مسائل شایعی هستند که مردان ممکن است با آن مواجه شوند. این مقاله با بررسی علائم، درمان‌ها، و روش‌های پیشگیری از بیماری‌های پروستات، به مخاطبان کمک می‌کند تا بهترین مراقبت را برای سلامتی پروستات خود انجام دهند.</p>
                    <p className="leading-loose text-justify text-red">علائم:</p>
                    <p className="leading-loose text-justify text-textColor">بیماری‌های پروستات می‌توانند با علائم مختلفی همراه باشند، از جمله: ادرار با آسیب‌های بیشتر، ناراحتی و درد در منطقه فرج، مشکلات در تحریک جنسی و... </p>
                    <p className="leading-loose text-justify text-red">درمان:</p>
                    <p className="leading-loose text-justify text-textColor">درمان بیماری‌های پروستات بسته به نوع بیماری و شدت آن متفاوت است.  درمان‌های معمول شامل داروها، عمل جراحی، و درمان‌های جایگزین مانند تغییرات در رژیم غذایی می‌شود.</p>
                    <p className="leading-loose text-justify text-red">پیشگیری:</p>
                    <p className="leading-loose text-justify text-textColor">پیشگیری از بیماری‌های پروستات مهم است و این شامل:</p>
                    <p className="leading-loose text-justify text-textColor">تغذیه سالم با فراورده‌های غنی از روغن‌های چرب امگا-3 و مواد مغذی</p>
                    <p className="leading-loose text-justify text-textColor">ورزش منظم</p>
                    <p className="leading-loose text-justify text-textColor">انجام آزمایشات پزشکی دوره‌ای برای زودتری شناسایی مشکلات پروستات</p>
                    <p className="leading-loose text-justify text-textColor">سلامتی پروستات از اهمیت بسیاری برخوردار است. اطلاعات کامل در مورد علائم، درمان، و پیشگیری از بیماری‌های پروستات می‌تواند به مردان کمک کند تا سلامتی خود را حفظ کنند و از مشکلات احتمالی پیشگیری کنند.</p>
                </div>
                <img src={blog03} alt='blogimage' className='object-cover w-[500px] rounded-lg shadow-2xl'/>
            </div>
            <div className='flex flex-col lg:flex-row lg:px-24 py-12 border-b border-gray'>
                <img src={blog04} alt='blogimage' className='object-cover w-[500px] rounded-lg shadow-2xl'/>
                <div className='lg:pr-28 pt-12 lg:pt-0'>
                    <h3 className="text-primaryColor text-xl mb-4">غربالگری سه ماهه اول بارداری</h3>
                    <p className="leading-loose text-justify text-textColor">آزمایش غربالگری سه ماهه اول بارداری شامل یک سری آزمون‌های پزشکی است که به منظور ارزیابی وضعیت سلامتی مادر و جنین در این مرحله انجام می‌شود. این آزمون‌ها شامل آزمایش خون، سونوگرافی، و سایر آزمون‌های تشخیصی است.</p>
                    <p className="leading-loose text-justify text-textColor">غربالگری سه ماهه اول بارداری یک تست ترکیبی شامل آزمایش خون مادر و سونوگرافی ( اندازه‌گیری NT و NB ) به همراه سن مادر است که بین ۱۱ هفته بارداری تا ۱۳ هفته و ۶ روز بارداری قابل انجام بوده و به وسیله آن ریسک سندرم داون (تریزومی ۲۱) و تریزومی ۱۳ و ۱۸ محاسبه می‌گردد. اندازه‌گیری NT و NB در سونوگرافی: اندازه‌گیری NT با سونوگرافی خاصی که از ۱۱ هفته بارداری تا ۱۳ هفته و ۶ روز بارداری قابل انجام است، صورت می‌گیرد. در این نوع سونوگرافی مقدار مایع در پشت گردن جنین که به آنNT می‌گویند، اندازه‌گیری می‌شود. تمام جنین‌ها در این قسمت دارای مقداری مایع هستند که این مقدار در جنین‌های مبتلا به سندرم داون تمایل به افزایش دارد. مشاهده تیغه استخوان بینی NB) (همزمان با NTانجام می شود. در صورتی که تیغه میانی اصلا تشکیل نشده باشد احتمال سندرم داون و سندرم ترنر داده می شود. آزمایش خون مادر: در آزمایش خون مادر سطح دو ماده که معمولاً در خون تمامی زنان باردار یافت می‌شود مورد اندازه‌گیری قرار می‌گیرد: در بارداری‌های توام با ابتلاء جنین به سندرم داون مقدار دو ماده مزبور تمایل به خروج از مقادیر مورد انتظار را نشان می‌دهد. مجموع نتایج NT، آزمایش خون مادر و سن مادر با یکدیگر تفسیر شده و یک ریسک عددی بدست می‌آید که بر اساس آن می‌توان تصمیم گرفت که قدم بعدی چیست. پس از غربالگری سه ماهه اول: نتایج غربالگری سه ماهه اول به پزشک می‌گوید که آیا لازم است تست‌های تشخیصی نظیر آمنیوسنتز برای خانم باردار انجام شود یا خیر. اکثر زنان پس از انجام غربالگری نتایجی دریافت می‌کنند که برمبنای آنها نیاز به انجام تست‌های تشخیصی منتفی است، اما به زنانی که ریسک سندرم داون، تریزومی ۱۸ و تریزومی ۱۳ آنان که بیش از میزان نرمال باشد، انجام تست‌های تشخیصی نظیر آمنیوسنتز پیشنهاد می‌شود. مزایای غربالگری سه ماهه اول: انجام غربالگری دقیق‌تر و زودتر، که باعث ایجاد آرامش خاطر در بسیاری از زنان می‌شود. با انجام سونوگرافی NT امکان تشخیص بعضی از اختلالات بارز هنگام تولد وجود دارد.</p>
                    <p className="leading-loose text-justify text-textColor"></p>
                </div>
            </div>
        </div>
    );
};

export default BlogPage;