import React, { useState } from 'react';

// helper Component
import ScrollToTop from '../helper/ScrollToTop';

const accordeon =[
    {
        title: "آزمایش چالش گلوکز GCT",
        description: "انجام تست چالش گلوکز (GCT) که یک تست یک مرحله ای است برای تشخیص زود هنگام دیابت حاملگی به تمامی مادران باردار در هفته ۲۴ تا ۲۸ حاملگی توصیه می شود. برای انجام این آزمایش نیاز به ناشتا بودن ندارد. کاهش فعالیت و یا بستری شدن درطول ۳ روز قبل از تست نباید وجود داشته باشد.فعالیت خود را درحد طبیعی حفظ کنید. چنانچه معمولا پس از خوردن صبحانه دچار تهوع ، سردرد یا بیحالی میشوید حتما به آزمایشگاه اطلاع دهید.  نیم ساعت قبل از شروع تست،استراحت کنید در عرض۵ دقیقه محلول قندی ( ۵۰ گرم گلوکز + ۳۰ سی سی آب + آب لیمو جهت جلوگیری از ایجاد حالت تهوع استفاده می شود ) را در حضور تکنسین آزمایشگاه بنوشید و تا زمان خونگیری استراحت کنید و از خوردن،آشامیدن،ورزش و مصرف دخانیات خودداری کنید. دقیقا یک ساعت پس از شروع مصرف محلول قند نمونه خون از شما گرفته می شود.",
    },
    {
        title: "آزمایش تحمل گلوکز GTT",
        description: "آمادگی برای آزمایش تحمل گلوگز خوراکی (OGTT): حداقل ۵ روز قبل از انجام تست، رژیم غذایی معمولی را حفظ کنید یعنی مصرف ۱۵۰ گرم مواد قندی در طول شبانه روز. چنانچه مبتلا به بی اشتهایی هستید تا ۵ روز قبل، این مشکل را با کمک پزشک رفع کنید. کاهش فعالیت ویا بستری شدن درطول ۳روز قبل از تست نباید وجود داشته باشد. فعالیت خود را درحد طبیعی حفظ کنید. از ۱۲ ساعت قبل به حالت ناشتا بوده و از نوشیدن قهوه، چای تلخ پرهیز کنید، سیگار نکشید و حتی ورزش سبک غیر مجاز است. از ۳ روز قبل مصرف داروهای غیر ضروری مثل مسکن ها را قطع کنید و چنانچه مجبور به مصرف داروهایی مثل دیورتیک،ضد التهاب،ضد تشنج،هورمون هستید با نظر پزشک خود موقتا آنها را قطع کنید. خانم ها باید مصرف قرص های ضدبارداری را به مدت یک سیکل کامل ماهانه قطع کرده باشند و چنانچه خانمی باردار میباشد حتما به آزمایشگاه اطلاع دهد. چنانچه اخیرا عمل جراحی شده اید و یا سوختگی و تصادف منجر به جراحت داشته اید و درمورد خانم ها زایمان داشته اند حتما به آزمایشگاه اطلاع دهید. چنانچه معمولا پس از خوردن صبحانه دچار تهوع،سردرد یا بیحالی میشوید حتما به آزمایشگاه اطلاع دهید. برای آقایان و خانمهای غیرباردار میزان قند برای آزمایش تحمل که باید میل گردد ۷۵گرم است.  آزمایش بعد از گرفتن نمونه ناشتا هر یک ساعت تا ۳ ساعت پس از میل نمودن محلول قندی ، آزمایش تکرار میگردد. نیم ساعت قبل از شروع تست،استراحت کنید و پس از اولین خونگیری در عرض ۵ دقیقه محلول قندی ( گلوکز + ۳۰ سی سی آب + آب لیمو جهت جلوگیری از ایجاد حالت تهوع استفاده می شود ) را در حضور تکنسین آزمایشگاه بنوشید و تا آخرین خونگیری استراحت کنید و از خوردن،آشامیدن،ورزش و مصرف دخانیات خودداری کنید.",
    },
    {
        title: "آزمایش پرولاکتین",
        description: "بیماران باید نکات زیر را پیش از انجام این آزمایش رعایت کنند: باید حداقل ۲ ساعت بعد از بیدار شدن از خواب نمونه خون بدهند. نمونه هایی که زودتر از این زمان تهیه شوند، افزایش ناشی از خواب را نشان خواهند داد. در شب قبل از آزمایش لباس گشاد و راحت بپوشند و از پوشیدن لباس های تنگ خصوصا درناحیه سینه و پستان ها اجتناب گردد.معاینه و نیز تحریک پستان ها طی ۲۴ ساعت قبل موجب اشتباه در نتیجه آزمایش می شود. بیماران باید از نزدیکی و تماس جنسی در شب قبل خودداری کنند. طی ۱۲ ساعت قبل از انجام آزمایش از ورزش و فعالیت های شدید بدنی خودداری نموده و مصرف قرص های ضد بارداری، کلروپرومازین و متیل دوپا را پس از مشورت با پزشک معالج قطع نمایند. استرس در زمان انجام آزمایش خصوصا در طی ۳۰ دقیقه پیش از آن موجب نتایج اشتباه می شود، لذا بیماران باید استرس خود را در زمان آزمایش به حداقل برسانند.",
    },
    {
        title: " آزمایش تیروئید",
        description: "آمادگی قبلی برای تمام آزمایشات، نیاز نیست. ولی بیشتر آزمایش ها نیازمند آمادگی های قبلی می باشند که با رعایت کردن آن ها می توانیم به نتایج درست دست یابیم. سوالی که ذهن اغلب بیماران را درگیر کرده است مسئله ناشتایی می باشد. همه ما معنای واقعی ناشتایی را می دانیم در واقع ناشتایی را می توان این گونه شرح داد : قبل از انجام آزمایش به مدت ۱۲ ساعت از غذا خوردن پرهیز کنید. از خوردن مایعات تا قبل از ۱۲ ساعت خودداری کنید ( در این جا در صورت لزوم نوشیدن آب بلامانع است.) از جویدن آدامس تا قبل از ۱۲ ساعت امتناع شود. از مصرف شكلات های مختلف، مینت ( تركیبات نعناع دار )، شربت های سینه یا قرص های نرم كننده گلو پرهیز کنید. اگر پزشک دستور قطع مصرف داروها را صادر نکرده باشد می توانیم آن ها را مانند گذشته مصرف کنیم. ( ولی آزمایشگاه را از مصرف آن ها مطلع سازید). طی ۱۲ ساعت قبل از آزمایش، دندان هایتان را مسواك بزنید. نکته حایز اهمیت این است که اگر دچار بیماری خاصی هستید و یا دارو مصرف می کنید آزمایشگاه را از این موضوع آگاه سازید.",
    },
    {
        title: "آزمایش اسپرموگرام",
        description: "فاصله بین انجام تست تا آخرین انزال (که به آن مدت زمان خودداری و یا امساک جنسی و یا Duration of Abstinence می گویند) باید بین ۲-۵ روز باشد (اگر این مقدارکمتراز ۲ روزبود رنگ متمایل به زرد بوده ولی درتحرک تاثیری ندارد اما اگر از ۵ روزبیشتر باشد تعداد اسپرمها زیاد می شود ولی بیشتر انها مرده اند و فاقد تحرک می باشند) توجه: معمولاً زمانی که تست اسپرموگرام در بار اول مشکلی دارد، توصیه می شود که یک نمونه دیگر هم بلافاصله انجام شود و میانگین دو نتیجه مورد تفسیر قرار گیرد، ولی ذکر این نکته خیلی اهمیت دارد که باید این نمونه هم فاصله زمانی از آخرین نزدیکی و یا انزال عین نمونه اول باشد (یعنی اگر نمونه اول ۴ روز بوده باشد دومی هم حتماً باید بعد از ۴ روز امساک جنسی گرفته شود). بهتر است در این فاصله از خوردن هر دارویی خودداری شود.(اگر داروی خاصی مصرف میکنید با آزمایشگاه در میان بگذارید). شب قبل از آزمایش از گرفتن دوش آب گرم و یا رفتن به سونای گرم و یا جکوزی گرم خودداری شود. بهتر است نمونه در آزمایشگاه و به روش استمناء گرفته شود (مخلوط شدن ترشحات منی با ترشحات واژن می تواند روی کیفیت مایع منی به شدت تأثیر بگذارد). اگر بیمار ترجیح میدهد در خانه نمونه گیری کند ، اهمیت رساندن سریع (تا ۲۰ دقیقه) و در دمای ۳۷ نمونه (نگه داری نمونه در زیر بغل) را باید به وی گوشزد کنید. استفاده از کاندوم یا مواد لزج کننده و... و نزدیکی ممکن است در نتایج تداخل کند، بنابراین روش ارجح برای گرفتن نمونه، روش استمناء می باشد.",
    },
    {
        title: "آزمایش پروستات PSA",
        description: "آزمایش پروستات PSA، اندازه‌گیری میزان ماده‌ای است که توسط غده پروستات ساخته می‌شود. پروستات غده‌ای به‌اندازهٔ گردو است که زیر مثانه قرار دارد. این غده به تولید مایع منی کمک می‌کند. نمونه ناشتا ترجیح داده میشود. از ۴۸ ساعت قبل از انجام آزمایش PSA انزال یا مقاربت و نیز دوچرخه‌سواری نداشته باشید، زیرا باعث افزایش سطح PSA می‌شود. از یک هفته پیش از انجام آزمایش هیچ‌گونه معاینه پروستات یا نمونه‌برداری از موضع پروستات نداشته باشید. از آنجا که پرتودرمانی (رادیوتراپی) و ترکیب تستوسترونی می‌توانند موجب تداخل در نتایج آزمایش گردند، لازم است که آزمایشگاه و پزشک معالج را در جریان قرار دهید.",
    },
    {
        title: "آزمایش قند خون ۲ ساعته",
        description: "لطفاٌ برای دست یابی به نتایج صحیح آزمایش به نکات ذیل توجه فرمایید. نتایج به خاطر عدم رعایت شرایط می تواند منجر به نادیده گرفته شدن مسائل مهم پزشکی یا درخواست بیش از اندازه و بدون نتیجه آزمایشگاهی گردد. شب قبل از آزمایش حداقل ۸ تا ۱۰ ساعت ناشتا باشید و در طی ناشتایی از خوردن چای و قهوه پرهیز نمایید. پس از اینکه نمونه خون ناشتا از شما گرفته شد صبحانه معمولی که هر روز میخورید (و یا به جای مصرف صبحانه ۷۵ گرم قند) میل نمیایید. وقتی اولین لقمه صبحانه را خوردید ساعت را یاداشت کنید. نمونه گیری دقیقاً ۲ ساعت پس از ساعت مذکور انجام میپذیرد. به عنوان مثال: اگر شما خوردن غذا را در ساعت ۸ صبح آغاز می کنید، نمونه آزمایش ساعت ۱۰ صبح از شما گرفته شود. مدت زمانی که غذا را میل می کنید نباید بیش از۲۰ دقیقه به طول انجامد. حتی الامکان صبحانه را در آزمایشگاه صرف نموده و تا زمان انجام آزمایش در آزمایشگاه منتظر بمانید. بعد از خوردن غذا به هیچ وجه چیز دیگری اعم از آدامس، شیرینی، آب میوه، نباید خورده شود ( به استثنا مقدار کم آب ). قبل از انجام آزمایش (در طی مدت ناشتایی شب قبل) و در حین ۲ساعت بعد سیگار نکشید. درطول آزمایش( در طی ۲ساعت) از ورزش و پیاده روی خودداری نمایید. آزمایش را حتماً قبل از ساعت ۱۰ صبح شروع کنید و از انجام آن در ساعات دیرتر خودداری کنید. در طی ۲ساعت از خوردن هر نوع خوردنی و آشامیدندی (آب در حد متعارف اشکالی ندارد) خودداری نمایید. آزمایش قند ناشتا و ۲ساعته را در یک روز انجام دهید.",
    },
    {
        title: "آزمایش اسکاچ scotch",
        description: "تخم کرم سوزنی به ندرت در مدفوع دیده می شود زیرا کرم ماده به مقعد مهاجرت کرده و تخم خود را در مقعد می ریزد . معمولاً مهاجرت کرم های سوزنی در زمان شب صورت می گیرد و تحریک مقعد توسط حرکات این کرم ها سبب بروز علائم عصبی و دندان فروجه (البته علل متعدد دیگری نیز وجود دارد) در بیماران که عمدتاً کودکان هستند میگردد. لطفا جهت نمونه گیری به نکات مربوطه دقت کنید: یک لام شیشه ای از آزمایشگاه(بخش نمونه گیری) تحویل بگیرید. دستهای خود را با آب و صابون بشوئید. بیمار را روی شکم بخوابانید یا وی را در حالت چهار دست و پا قرار دهید تا قسمت پشت و مقعد بیمار کاملاً در دسترس نمونه گیری قرار گیرد. یک قطعه نوار چسب اسکاچ(چسب شیشه ای) به طول ۱۰ سانتیمتر را جدا کرده و از ۲ طرف آنرا بگیرید. چسب را مکرراً روی مقعد و چین های دور مقعد بچسبانید و جدا کنید. پس از انجام عمل فوق بدون اینکه قسمت چسبی به دستتان بخورد چسب را صاف روی لام شیشه ای بچسبانید و داخل دستمال بپیچید و به آزمایشگاه تحویل دهید.",
    },
    {
        title: "آزمایش غربالگری ۳ ماهه اول بارداری",
        description: "غربالگری سه ماهه اول بارداری یک تست ترکیبی شامل آزمایش خون مادر و سونوگرافی ( اندازه‌گیری NT و NB ) به همراه سن مادر است که بین ۱۱ هفته بارداری تا ۱۳ هفته و ۶ روز بارداری قابل انجام بوده و به وسیله آن ریسک سندرم داون (تریزومی ۲۱) و تریزومی ۱۳ و ۱۸ محاسبه می‌گردد. اندازه‌گیری NT و NB در سونوگرافی: اندازه‌گیری NT با سونوگرافی خاصی که از ۱۱ هفته بارداری تا ۱۳ هفته و ۶ روز بارداری قابل انجام است، صورت می‌گیرد. در این نوع سونوگرافی مقدار مایع در پشت گردن جنین که به آنNT می‌گویند، اندازه‌گیری می‌شود. تمام جنین‌ها در این قسمت دارای مقداری مایع هستند که این مقدار در جنین‌های مبتلا به سندرم داون تمایل به افزایش دارد. مشاهده تیغه استخوان بینی NB) (همزمان با NTانجام می شود. در صورتی که تیغه میانی اصلا تشکیل نشده باشد احتمال سندرم داون و سندرم ترنر داده می شود. آزمایش خون مادر: در آزمایش خون مادر سطح دو ماده که معمولاً در خون تمامی زنان باردار یافت می‌شود مورد اندازه‌گیری قرار می‌گیرد: در بارداری‌های توام با ابتلاء جنین به سندرم داون مقدار دو ماده مزبور تمایل به خروج از مقادیر مورد انتظار را نشان می‌دهد. مجموع نتایج NT، آزمایش خون مادر و سن مادر با یکدیگر تفسیر شده و یک ریسک عددی بدست می‌آید که بر اساس آن می‌توان تصمیم گرفت که قدم بعدی چیست. پس از غربالگری سه ماهه اول: نتایج غربالگری سه ماهه اول به پزشک می‌گوید که آیا لازم است تست‌های تشخیصی نظیر آمنیوسنتز برای خانم باردار انجام شود یا خیر. اکثر زنان پس از انجام غربالگری نتایجی دریافت می‌کنند که برمبنای آنها نیاز به انجام تست‌های تشخیصی منتفی است، اما به زنانی که ریسک سندرم داون، تریزومی ۱۸ و تریزومی ۱۳ آنان که بیش از میزان نرمال باشد، انجام تست‌های تشخیصی نظیر آمنیوسنتز پیشنهاد می‌شود. مزایای غربالگری سه ماهه اول: انجام غربالگری دقیق‌تر و زودتر، که باعث ایجاد آرامش خاطر در بسیاری از زنان می‌شود. با انجام سونوگرافی NT امکان تشخیص بعضی از اختلالات بارز هنگام تولد وجود دارد.",
    },
    {
        title: "آزمایش کشت ادرار خانم ها",
        description: "نمونه ادرار برای تشخیص انواع عفونت های دستگاه ادرای و اثبات وجود برخی از مواد و سلول ها از جمله قند، پروتئین ، خون، گلبول های سفید و گلبول های قرمز تحت بررسی قرار گرفته و در صورت لزوم کشت داده می شود. بهترین زمان برای نمونه گبری ادرار صبحگاهیست یعنی ادرار پس از خواب و قبل از خوردن صبحانه. در صورتیکه دچار تکرار ادرار هستید بهتر است از زمان آخرین دفع ، حداقل دو ساعت گذشته باشد و در طول این مدت از مایعات کمتر استفاده شود. اگر ازآنتی بیوتیک ، پماد ، کرم یا داروی خاصی استفاده می کنید قبل از نمونه گیری آزمایشگاه را مطلع سازید. جهت انجام کشت های میکربی ازجمله کشت ادرار می بایست حداقل یک هفته از آخرین مصرف داروی آنتی بیوتیک گذشته باشد مگر درمواردی که بااطلاع پزشک معالج بیمار می باشد. لطفاً قبل از ‌آغاز نمونه گیری موارد مربوطه را به دقت مطالعه نمایید: پیش از انجام آزمایش از نوشیدن بیش از حد مایعات اجتناب کنید . نمونه ادرار را فقط در ظرف مخصوص آزمایشگاه جمع آوری نمایید . این ظرف یکبار مصرف و کاملا استریل می باشد . مشخصات ثبت شده بر روی بر چسب را به دقت کنترل نمایید . قبل از اقدام به نمونه گیری دستهای خود را با صابون بشویید . عضو تناسلی خود را با آب و صابون بشویید و یا دستمال خشک نمایید . دقت فرمایید که جهت شستشو می بایست از جلو به عقب (از واژن به سمت رکتوم ) باشد . سپس کسی منتظر بمانید تا خشک شود. درب ظرف را باز کرده و بدون تماس انگشتان با جدار داخلی ظرف آن را زیر مجرای ادراری خود گرفته و با دست دیگر لب های واژن را از هم باز نمایید . قسمت ابتدایی ادرار را در حد چند قطره به داخل توالت ریخته و قسمت میانی ادرار را حداقل تا یک سوم ظرف داخل ظرف تخلیه نمایید . درب ظرف را محکم بسته و در مکان تعیین شده قرار دهید . در صورتی که نمونه خارج از آزمایشگاه تهیه می شود لازم است تا به سرعت به آزمایشگاه ارسال شده و تا آن زمان در در یخچال نگه داری شود. چنانچه در زمان قاعدگی می باشید جهت جلوگیری از جریان خون از یک تامپون مخصوص که از قبل تهیه می کنید استفاده نمایید. بهتر است ادرار اول صبح جهت کشت ادرار جمع آوری کنید .( یعنی ادرار پس از خواب و قبل از خوردن صبحانه ). بهتر است در صورت امکان شب پیش از نمونه برداری حمام کنید. توجه : ورود مقادیر بسیار جزئی مایع صابون یا ساولن به داخل ظرف منجر به بروز نتایج کشت منفی کاذب می گردد . از طرفی تماس دست با جدار داخلی ظرف ، ورود آب به درون آن یا باز ماندن درب ظرف و همچنین عدم شستشوی کامل عضو تناسلی منجر به کشت های مثبت پلی میکرو بیال و آلوده می گردد .",
    },
    {
        title: " نمونه گیری ادرار آزمایش کشت و آنالیز",
        description: "(بانوان): با يك دست، چين هاي پوستي دستگاه تناسلي را از هم باز كرده و با يك دستمال يك بار مصرف مرطوب حاوي صابون اطراف پيشابراه و معقد را از جلو به عقب تميز كنيد. سپس دستمال جديدي برداشته و با آب خيس كنيد و مجددا عمل تميز كردن را انجام دهيد. درب ظرف ادرار را باز كنيد تحت هيچ عنوان دست¬هاي شما نبايد با سطح داخلي ظرف يا سطح داخلی درب آن تماس پيدا كند. (آقایان): سر آلت را با يك دستمال يك بار مصرف مرطوب آغشته به صابون تميز كنيد و دستمال را دور بيندازيد. سپس دستمال جديدي برداشته و با آب خيس كنيد و مجددا عمل تميز كردن را انجام دهيد. (نوزادان): در مورد نوزادان و کودکان زیر دو سال باید ازکیسه‌‌‌‌‌های سترون شده مخصوص جمع‌آوری ادرار(Urine Bag) استفاده کرد، كیسه باید متناسب با جنس كودك (پسرانه یا دخترانه) باشد. این كیسه نباید بیش از ۴۵ دقیقه به مجرای ادرار متصل باشد. وقتی حـدود ۱۰-۱۵ میلی لیتر ادرار در کیسه جمع شد سر آن‌ را تا کرده و سپس به آزمایشگاه‌ انتقال دهید. اگر زمان گذاشتن کیسه طولانی شد و نوزاد ادرار نکرد، جهت جلوگیری از آلودگی کیسه، باید آن را تعویض نمود. توجه داشته باشيد كه ظرف ادرار با پوست اطراف ناحيه تناسلي تماس پيدا نكند. مقدار كمي از قسمت اول ادرار (دو ثانيه اول) را به داخل توالت تخليه كنيد و حدود ۳۰ ميلي ليتر (نصف ظرف نمونه) از وسط ادرار را جمع آوري نمایيد و آخر ادرار را داخل توالت تخليه كنيد. در هنگام گرفتن نمونه مواظب باشید درب ظرف آلوده نشود و آن را در جای مناسب نگه دارید. درب ظرف نمونه را بسته و آن را تحويل آزمايشگاه دهيد. اگر طی دو هفته قبل دارو مصرف نموده اید حتما در مورد داروهای مصرفی خود قبل از نمونه‌گیری با آزمایشگاه مشورت کنید.",
    },
    {
        title: " آزمایش جمع آوری نمونه خون مخفی درمدفوع OB",
        description: "گاهی اوقات خونریزی های مختصری دربخشهای مختلف دستگاه گوارش اتفاق میفتد که به علت مقدارکم باچشم قابل دیدن نیست. بنابراین باید با روشهای آزمایشگاهی تشخیص داده شود. بهتراست این آزمایش در۳ نوبت انجام شود. جهت انجام آزمایش خون مخفی در مدفوع(Occult Blood) لازم است ۷۲-۴۸ ساعت مواد دارای فیبر غذایی بالا میل نمایید. به مدت ۴ روز از خوردن گوشت قرمز(بهتر است گوشت مرغ و ماهی نیز مصرف نگردد)، جگر، گوشت­های فرآوری شده (سوسیس و کالباس)سبزیجات دارای فعالیت پراکسیداز بالا (شامل: چغندر (لبو)، کلم بروکلی، گل­کلم،ترب، تربچه، قارچ، هویج‌فرنگی، شلغم) میوه‌های حاوی ویتامین C (شامل: موز، انگور،طالبی، گرمک، خربزه، پرتقال) خودداری شود. از ۷ روز قبل از انجام آزمایش از مصرف داروهای زیر اجتناب شود: انواع داروهای آهن(هماتنیک، فروس سولفات، فیفول)، ویتامینC،دیوریتیک­های تیازیدی، رزرپین، داروهای استروئیدی، داروهای ضد التهاب(مانند ایبوپروفن، ایندومتاسین، دیکلوفناک سدیم و آسپرین، سالیسیلات اسید، کلشی­سین، آنتی­اسیدها و ترکیبات ید­دار). نمونه مدفوع نباید در طول پریود جمع ­آوری شود. از ۳ روز قبل از جمع آوری، مصرف الکل قطع شود. در صورت استفاده از توالت­ فرنگی حتما از کاغذ یا پوشش دیگری استفاده کنید تا نمونه با آب موجود در کاسه توالت مخلوط نشود. مقدار نمونه لازم برای ازمایش حدود ۵ گرم (حداقل معادل یک نخود) از چند جای مدفوع می باشد که آنرا با قاشقک ظرف تحویل داده شده به شما، به داخل ظرف منتقل کنید. نمونه با ادرار یا آب مخلوط نشود.",
    },
    {
        title: "آزمایش جمع آوری ادرار ۲۴ ساعته",
        description: "این دستورالعمل را در آزمایشگاه مطالعه نمایید و هرگونه سوالی را از پرسنل نمونه‌گیری بپرسید: در ابتدای زمان شروع ۲۴ ساعت، کل ادرار مثانه خویش را تخلیه نمایید(این نمونه را در ظرف جمع­ آوری نمایید). پس از تخلیه ادرار زمان را یادداشت نمایید و از این پس تا ۲۴ ساعت از زمان یاداشت شده تمام ادرار خویش را داخل ظرف جمع­ آوری نمایید. آخرین ادرار باید راس ۲۴ ساعت از زمان تخلیه اولیه جمع­ آوری گردد. زمانبندی ۲۴ ساعته را به گونه­ای تنظیم نمایید که در روزهای شنبه تا چهارشنبه نمونه را قبل از ساعت ۲ بعدازظهر و در روزهای پنجشنبه قبل از ساعت ۱۱ تحویل آزمایشگاه دهید. از ادرار کردن مستقیم داخل ظرف جمع­آوری خودداری نمایید(بعضی از ظروف حاوی اسید به عنوان نگهدارنده هستندکه می تواند باعث آسیب به ناحیه تناسلی شما شود). ظرفی که برای جمع­آوری اولیه و انتقال به ظرف اصلی انتخاب می‌کنید دهان گشاد و به اندازه کافی حجیم باشد که کل ادرار تخلیه شده در آن جا شود. دقت نمایید هیچ مقداری از ادرار ۲۴ ساعته از دست نرود(عدم جمع­آوری حتی مقدار اندک ادرار می‌تواند نتایج به دست آمده را نامعتبر و اشتباه سازد). ظروف تحویل داده به شما یکبار مصرف و تمیز هستند بنابراین می‌توانید در موارد نیازمند نگهداری یخچال آن را به راحتی در یخچال بگذارید(در این موارد حتما درب ظرف را محکم نمایید). روی ظرف برچسبی هست که باید قد و وزن شما روی آن ثبت شده باشد. دقت نمایید این برچسب مخدوش نشود. زمان شروع و خاتمه ۲۴ ساعت را روی برگه نصب شده روی ظرف ثبت نمایید. در مواردی که دو ظرف ادرار ۲۴ ساعته دارید در دو روز مختلف اقدام به جمع­آوری دو نمونه نمایید و هر ظرف را بعد از جمع آوری در همان روز تحویل آزمایشگاه دهید(از نگهداری ظرفها و تحویل آنها با هم خودداری نمایید). ادرار ۲۴ ساعته که در همان روز جمع ­آوری تحویل داده نشود از طرف آزمایشگاه تحویل نخواهد شد و نیازمند نمونه­ گیری مجدد است. برای تحویل، نمونه را در محل قرار دادن نمونه در دستشویی اسکن نمایید فیش دریافت کرده و فیش را تحویل بخش پذیرش نمایید. اگر حجم ادرارتان بالاست، دو ظرف ادرار ۲۴ ساعته از آزمایشگاه درخواست نمایید.",
    },
]

const TestList = () => {

    const [activeId, setActivId] = useState(null);

    const toggleFunction = (index) => {
        if(activeId === index) {
            setActivId(null);
        } else {
            setActivId(index);
        }
    };

    return (
            <>
            <ScrollToTop />
            <div class="flex flex-col items-center lg:items-start text-center lg:text-right lg:px-24 px-8 w-full pt-36">
                <h1 class="text-lg font-bold text-textColor">آمادگی های قبلی برای انجام آزمایش</h1>
                <div class="h-1 w-20 bg-primaryColor rounded mt-4"></div>
            </div>
            <div className='w-full h-auto lg:px-24 px-8 py-8 flex justify-center'>
                <div className='w-full h-max border border-gray rounded overfelow-hidden text-textColor shadow-xl cursor-pointer'>
                    
                    {accordeon.map((item, i) => (
                        <div key={i} className='border-b border-gray shadow-lg last:border-b-0'>
                            <div className={`px-5 py-4 flex items-center justify-between ${activeId === i ? "text-primaryColor" : ""}`} onClick={()=>toggleFunction(i)}>
                                <p>{item.title}</p>
                                <span>

                                    {
                                        activeId === i ? 
                                            <svg xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 24 24" stroke-width="1.5" stroke="currentColor" class="w-6 h-6">
                                                <path stroke-linecap="round" stroke-linejoin="round" d="m4.5 15.75 7.5-7.5 7.5 7.5" />
                                            </svg> :
                                            <svg xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 24 24" stroke-width="1.5" stroke="currentColor" class="w-6 h-6">
                                                <path stroke-linecap="round" stroke-linejoin="round" d="m19.5 8.25-7.5 7.5-7.5-7.5" />
                                            </svg>                                      
                                    }
                                </span>
                            </div>

                            {activeId === i && (
                                <div className={`px-8 py-8 flex items-center justify-between ${activeId === i ? "bg-bgSection" : ""}`}>
                                    <p className='leading-loose text-sm text-justify'>{item.description}</p>
                                </div>
                            )}
                        </div>
                    ))}
                </div>
            </div>
        </>
    );
};

export default TestList;